[
  {
    "_id": "1",
    "name": "Luke Skywalker",
    "image": "https://lumiere-a.akamaihd.net/v1/images/luke-skywalker-main_7ffe21c7.jpeg?region=130%2C147%2C1417%2C796",
    "description": "Luke Skywalker was a Tatooine farmboy who rose from humble beginnings to become one of the greatest Jedi the galaxy has ever known. Along with his friends Princess Leia and Han Solo, Luke battled the evil Empire, discovered the truth of his parentage, and ended the tyranny of the Sith. A generation later, the location of the famed Jedi master was one of the galaxy’s greatest mysteries. Haunted by Ben Solo’s fall to evil and convinced the Jedi had to end, Luke sought exile on a distant world, ignoring the galaxy’s pleas for help. But his solitude would be interrupted – and Luke Skywalker had one final, momentous role to play in the struggle between good and evil.",
    "height": "172",
    "mass": "77",
    "hair_color": "blond",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "19BBY",
    "gender": "male",
    "homeworld": "1",
    "films": ["1", "2", "3", "6"]
  },
  {
    "_id": "2",
    "name": "C-3PO",
    "image": "https://lumiere-a.akamaihd.net/v1/images/c-3po-main_417a2902.jpeg?region=176%2C0%2C951%2C536",
    "description": "C-3PO longs for more peaceful times, but his continued service to the Resistance — and his knowledge of more than seven million forms of communication — keeps the worry-prone droid in the frontlines of galactic conflict. Programmed for etiquette and protocol, Threepio was built by a young Anakin Skywalker, and has been a constant companion to astromech R2-D2. Over the years, he was involved in some of the galaxy’s most defining moments and thrilling battles. Since the Empire’s defeat, C-3PO has served Leia Organa, head of a Resistance spy ring aimed at undermining the First Order.",
    "height": "167",
    "mass": "75",
    "hair_color": "n/a",
    "skin_color": "gold",
    "eye_color": "yellow",
    "birth_year": "112BBY",
    "gender": "n/a",
    "homeworld": "1",
    "films": ["1", "2", "3", "4", "5", "6"]
  },
  {
    "_id": "3",
    "name": "R2-D2",
    "image": "https://lumiere-a.akamaihd.net/v1/images/r2-d2-main_f315b094.jpeg?region=273%2C0%2C951%2C536",
    "description": "A reliable and versatile astromech droid, R2-D2 has served Padmé Amidala, Anakin Skywalker, and Luke Skywalker in turn, showing great bravery in rescuing his masters and their friends from many perils. A skilled starship mechanic and fighter pilot's assistant, he has an unlikely but enduring friendship with the fussy protocol droid C-3PO.",
    "height": "96",
    "mass": "32",
    "hair_color": "n/a",
    "skin_color": "white, blue",
    "eye_color": "red",
    "birth_year": "33BBY",
    "gender": "n/a",
    "homeworld": "8",
    "films": ["1", "2", "3", "4", "5", "6"]
  },
  {
    "_id": "4",
    "name": "Darth Vader",
    "image": "https://lumiere-a.akamaihd.net/v1/images/darth-vader-main_4560aff7.jpeg?region=0%2C67%2C1280%2C720",
    "description": "Once the heroic Jedi Knight named Anakin Skywalker, Darth Vader was seduced by the dark side of the Force. Forever scarred by his defeat on Mustafar, Vader was transformed into a cybernetically-enhanced Sith Lord. At the dawn of the Empire, Vader led the Empire’s eradication of the Jedi Order and the search for survivors. He remained in service of the Emperor -- the evil Darth Sidious -- for decades, enforcing his Master’s will and seeking to crush the Rebel Alliance and other detractors. But there was still good in him…",
    "height": "202",
    "mass": "136",
    "hair_color": "none",
    "skin_color": "white",
    "eye_color": "yellow",
    "birth_year": "41.9BBY",
    "gender": "male",
    "homeworld": "1",
    "films": ["1", "2", "3", "6"]
  },
  {
    "_id": "5",
    "name": "Leia Organa",
    "image": "https://lumiere-a.akamaihd.net/v1/images/leia-organa-main_9af6ff81.jpeg?region=187%2C157%2C1400%2C786",
    "description": "Princess Leia Organa was one of the greatest leaders of the Rebel Alliance, fearless on the battlefield and dedicated to ending the Empire’s tyranny. Daughter of Padmé Amidala and Anakin Skywalker, sister of Luke Skywalker, and with a soft spot for scoundrels, Leia ranked among the galaxy’s great heroes. But life under the New Republic proved difficult for her. Sidelined by a new generation of political leaders, she struck out on her own to oppose the First Order as founder of the Resistance. These setbacks in her political career were accompanied by more personal losses, which she endured with her seemingly inexhaustible will.",
    "height": "150",
    "mass": "49",
    "hair_color": "brown",
    "skin_color": "light",
    "eye_color": "brown",
    "birth_year": "19BBY",
    "gender": "female",
    "homeworld": "2",
    "films": ["1", "2", "3", "6"]
  },
  {
    "_id": "6",
    "name": "Owen Lars",
    "image": "https://lumiere-a.akamaihd.net/v1/images/owen-lars-main_08c717c8.jpeg?region=0%2C34%2C1053%2C593",
    "description": "Owen Lars continued his father Cliegg’s efforts to build his homestead into a productive farm, working alongside his wife, Beru. Helping with the dreary chores required to keep the farm profitable, Owen relies on his nephew, Luke Skywalker, whom the couple raised since birth. Like most moisture farmers on Tatooine, Lars is fiercely protective of his land and his family. When there is an intrusion on the tranquility of the Lars Homestead, Owen defends his home.",
    "height": "178",
    "mass": "120",
    "hair_color": "brown, grey",
    "skin_color": "light",
    "eye_color": "blue",
    "birth_year": "52BBY",
    "gender": "male",
    "homeworld": "1",
    "films": ["1", "5", "6"]
  },
  {
    "_id": "7",
    "name": "Beru Whitesun lars",
    "image": "https://static.wikia.nocookie.net/esstarwars/images/c/cc/BeruCardTrader.png/revision/latest/scale-to-width-down/350?cb=20171231024525",
    "description": "She was the aunt of Jedi Knight Luke Skywalker. Lars married the stepbrother of former Jedi Knight Anakin Skywalker, Owen Lars. Beru raised Luke Skywalker in her home planet, Tatooine. She died in a Stormtrooper attack in her Tatooine.",
    "height": "165",
    "mass": "75",
    "hair_color": "brown",
    "skin_color": "light",
    "eye_color": "blue",
    "birth_year": "47BBY",
    "gender": "female",
    "homeworld": "1",
    "films": ["1", "5", "6"]
  },
  {
    "_id": "8",
    "name": "R5-D4",
    "image": "https://lumiere-a.akamaihd.net/v1/images/r5-d4_main_image_7d5f078e.jpeg?region=374%2C0%2C1186%2C666",
    "description": "A red astromech droid, R5-D4 thought he'd found a home when the Jawas sold him to Owen Lars, along with the protocol droid C-3PO. But R5's motivator blew as he rolled away from the sandcrawler, forcing the Jawas to take him back in exchange for R2-D2.",
    "height": "97",
    "mass": "32",
    "hair_color": "n/a",
    "skin_color": "white, red",
    "eye_color": "red",
    "birth_year": "unknown",
    "gender": "n/a",
    "homeworld": "1",
    "films": ["1"]
  },
  {
    "_id": "9",
    "name": "Biggs Darklighter",
    "image": "https://lumiere-a.akamaihd.net/v1/images/image_606ff7f7.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Biggs Darklighter grew up on Tatooine with Luke Skywalker, and shared his friend's dreams of escaping the dull desert world. After graduating from the Imperial Academy, he defected from the Empire's service to join the Rebellion. He and Luke were reunited at Yavin 4's Rebel base, and flew together against the Death Star. Luke returned from that mission as a hero, but Biggs did not survive.",
    "height": "183",
    "mass": "84",
    "hair_color": "black",
    "skin_color": "light",
    "eye_color": "brown",
    "birth_year": "24BBY",
    "gender": "male",
    "homeworld": "1",
    "films": ["1"]
  },
  {
    "_id": "10",
    "name": "Obi-Wan Kenobi",
    "image": "https://lumiere-a.akamaihd.net/v1/images/obi-wan-kenobi-main_3286c63c.jpeg?region=0%2C0%2C1280%2C721",
    "description": "A legendary Jedi Master, Obi-Wan Kenobi was a noble man and gifted in the ways of the Force. He trained Anakin Skywalker, served as a general in the Republic Army during the Clone Wars, and guided Luke Skywalker as a mentor.",
    "height": "182",
    "mass": "77",
    "hair_color": "auburn, white",
    "skin_color": "fair",
    "eye_color": "blue-gray",
    "birth_year": "57BBY",
    "gender": "male",
    "homeworld": "20",
    "films": ["1", "2", "3", "4", "5", "6"]
  },
  {
    "_id": "11",
    "name": "Anakin Skywalker",
    "image": "https://lumiere-a.akamaihd.net/v1/images/anakin-skywalker-main_0326586e.png?region=220%2C0%2C951%2C536",
    "description": "Discovered as a slave on Tatooine by Qui-Gon Jinn and Obi-Wan Kenobi, Anakin Skywalker had the potential to become one of the most powerful Jedi ever. Some even believed he was the prophesied Chosen One who would bring balance to the Force. Always pushing the limits of his Jedi training, seeking to excel and live up to his reputation, Skywalker's passion often brought him into conflict with his mentor, Jedi Master Obi-Wan Kenobi. A hero of the Clone Wars, Anakin was caring and compassionate, but suffered from a deep fear of loss that would prove to be his downfall.",
    "height": "188",
    "mass": "84",
    "hair_color": "blond",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "41.9BBY",
    "gender": "male",
    "homeworld": "1",
    "films": ["4", "5", "6"]
  },
  {
    "_id": "12",
    "name": "Wilhuff Tarkin",
    "image": "https://static.wikia.nocookie.net/esstarwars/images/6/6c/Cara_de_Tarkin.jpg/revision/latest/scale-to-width-down/350?cb=20150207011053",
    "description": "Tarkin is depicted as a high-ranking officer of the Galactic Empire, placed in charge of the operations on the Death Star, the Empire's dwarf planet-sized battle station. He orders the destruction of the planet Alderaan by the station's superlaser, and is killed at the end of the film by Luke Skywalker, who destroys the Death Star with Tarkin still on board.",
    "height": "180",
    "mass": "unknown",
    "hair_color": "auburn, grey",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "64BBY",
    "gender": "male",
    "homeworld": "21",
    "films": ["1", "6"]
  },
  {
    "_id": "13",
    "name": "Chewbacca",
    "image": "https://lumiere-a.akamaihd.net/v1/images/chewie-main_e1968a8a.jpeg?region=131%2C0%2C951%2C536",
    "description": "A legendary Wookiee warrior and Han Solo’s longtime co-pilot, Chewbacca continues to serve as faithful first mate to carry out daring missions against the First Order behind the controls of the Millennium Falcon. Known as Chewie to his closest friends, he was part of a core group of rebels who restored freedom to the galaxy during the reign of the Galactic Empire. Known for his short temper and accuracy with a bowcaster, Chewie also has a big heart and unwavering loyalty to his friends.",
    "height": "228",
    "mass": "112",
    "hair_color": "brown",
    "skin_color": "unknown",
    "eye_color": "blue",
    "birth_year": "200BBY",
    "gender": "male",
    "homeworld": "14",
    "films": ["1", "2", "3", "6"]
  },
  {
    "_id": "14",
    "name": "Han Solo",
    "image": "https://lumiere-a.akamaihd.net/v1/images/han-solo-main_a4c8ff79.jpeg?region=0%2C0%2C1920%2C1080",
    "description": "Han Solo rose from an impoverished childhood on the mean streets of Corellia to become one of the heroes of the Rebel Alliance. As captain of the Millennium Falcon, Han and his co-pilot Chewbacca came to believe in the cause of galactic freedom, joining Luke Skywalker and Princess Leia Organa in the fight against the Empire. After the Battle of Endor, Han faced difficult times in a chaotic galaxy, leading to a shattering confrontation with his estranged son Ben.",
    "height": "180",
    "mass": "80",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "brown",
    "birth_year": "29BBY",
    "gender": "male",
    "homeworld": "22",
    "films": ["1", "2", "3"]
  },
  {
    "_id": "15",
    "name": "Greedo",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_greedo_01_169_3e4b96ef.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Greedo was a Rodian bounty hunter with a tapir-like snout, bulbous eyes, pea-green skin, and a crest of spines atop his skull. He was overzealous and a bit slow on the take, not to mention a pretty poor shot with a blaster. Though he fancied himself a big time bounty hunter in the employ of no less an underworld figure than Jabba the Hutt, in truth, no one took him too seriously.",
    "height": "173",
    "mass": "74",
    "hair_color": "n/a",
    "skin_color": "green",
    "eye_color": "black",
    "birth_year": "44BBY",
    "gender": "male",
    "homeworld": "23",
    "films": ["1"]
  },
  {
    "_id": "16",
    "name": "Jabba Desilijic Tiure",
    "image": "https://lumiere-a.akamaihd.net/v1/images/Jabba-The-Hutt_b5a08a70.jpeg?region=0%2C0%2C1200%2C675",
    "description": "Jabba the Hutt was one of the galaxy’s most powerful gangsters, with far-reaching influence in both politics and the criminal underworld. There were no second chances with Jabba, something Han Solo would find out -- though the slug-like alien would ultimately fall victim to his own hubris and vengeful ways.",
    "height": "175",
    "mass": "1,358",
    "hair_color": "n/a",
    "skin_color": "green-tan, brown",
    "eye_color": "orange",
    "birth_year": "600BBY",
    "gender": "hermaphrodite",
    "homeworld": "24",
    "films": ["1", "3", "4"]
  },
  {
    "_id": "18",
    "name": "Wedge Antilles",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_wedgeantilles_01_169_b8185dce.jpeg?region=0%2C0%2C1560%2C878",
    "description": "A talented young rebel pilot from Corellia, Wedge Antilles survived the attack on the first Death Star to become a respected veteran of Rogue Squadron. He piloted a snowspeeder in the defense of Echo Base on Hoth, and led Red Squadron in the rebel attack on the second Death Star above Endor.",
    "height": "170",
    "mass": "77",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "hazel",
    "birth_year": "21BBY",
    "gender": "male",
    "homeworld": "22",
    "films": ["1", "2", "3"]
  },
  {
    "_id": "19",
    "name": "Jek Tono Porkins",
    "image": "https://lumiere-a.akamaihd.net/v1/images/jek-porkins-main-image_0b8d2d13.jpeg?region=0%2C0%2C1280%2C721",
    "description": "Jek Porkins was a pilot and trader who abandoned his homeworld when the Empire moved in and developed a new military base there. The burly rebel pilot flew an X-wing at the Battle of Yavin under the call sign Red 6. His X-wing developed a mechanical problem early in the battle, leaving him struggling to maneuver. Before Porkins or his astromech could fix the problem, one of the Death Star’s turbolasers zeroed in on the X-wing, incinerating it and killing Porkins instantly.",
    "height": "180",
    "mass": "110",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "26",
    "films": ["1"]
  },
  {
    "_id": "20",
    "name": "Yoda",
    "image": "https://lumiere-a.akamaihd.net/v1/images/Yoda-Retina_2a7ecc26.jpeg?region=0%2C0%2C1536%2C864",
    "description": "Yoda was a legendary Jedi Master and stronger than most in his connection with the Force. Small in size but wise and powerful, he trained Jedi for over 800 years, playing integral roles in the Clone Wars, the instruction of Luke Skywalker, and unlocking the path to immortality.",
    "height": "66",
    "mass": "17",
    "hair_color": "white",
    "skin_color": "green",
    "eye_color": "brown",
    "birth_year": "896BBY",
    "gender": "male",
    "homeworld": "28",
    "films": ["2", "3", "4", "5", "6"]
  },
  {
    "_id": "21",
    "name": "Palpatine",
    "image": "https://lumiere-a.akamaihd.net/v1/images/emperor-palpatine-main_d6632d0a.jpeg?region=237%2C0%2C1445%2C813",
    "description": "The dark side of the Force is a pathway to many abilities some consider to be unnatural, and Sheev Palpatine is the most infamous follower of its doctrines. Scheming, powerful, and evil to the core, Darth Sidious restored the Sith and destroyed the Jedi Order. Living a double life, he was also Palpatine, a Naboo Senator and phantom menace. He manipulated the political system of the Galactic Republic until he was named Supreme Chancellor -- and eventually Emperor – and ruled the galaxy through fear and tyranny. The galaxy rejoiced when he died at the Battle of Endor, but Sidious had cheated death and patiently plotted a return to power.",
    "height": "170",
    "mass": "75",
    "hair_color": "grey",
    "skin_color": "pale",
    "eye_color": "yellow",
    "birth_year": "82BBY",
    "gender": "male",
    "homeworld": "8",
    "films": ["2", "3", "4", "5", "6"]
  },
  {
    "_id": "22",
    "name": "Boba Fett",
    "image": "https://lumiere-a.akamaihd.net/v1/images/boba-fett-main_a8fade4d.jpeg?region=203%2C34%2C1077%2C606",
    "description": "With his customized Mandalorian armor, deadly weaponry, Boba Fett was once regarded as one of the most fearsome and capable bounty hunters in the galaxy. An unaltered genetic clone of his father, bounty hunter Jango Fett, Boba learned combat and martial skills from a young age. Over the course of his career, which included contracts for the Empire and the criminal underworld, he became a legend. Although Fett seemingly met his demise in the Sarlacc pit on Tatooine after falling into the Great Pit of Carkoon, Boba survived the beast and lived to reclaim his armor, taking over the throne at Jabba's Palace.",
    "height": "183",
    "mass": "78.2",
    "hair_color": "black",
    "skin_color": "fair",
    "eye_color": "brown",
    "birth_year": "31.5BBY",
    "gender": "male",
    "homeworld": "10",
    "films": ["2", "3", "5"]
  },
  {
    "_id": "23",
    "name": "IG-88",
    "image": "https://lumiere-a.akamaihd.net/v1/images/ig_88_cdd5cc52.jpeg?region=0%2C95%2C2453%2C1375",
    "description": "Many people in the galaxy fear droids, what with the memories of the Clone Wars still fresh in their minds. Far more terrifying than battle droids were assassin droids, independently programmed mechanical killers that had no masters. IG-88 is a battered chrome war droid who has become a bounty hunter, and answered Darth Vader's call to capture the Millennium Falcon during the events surrounding the Battle of Hoth.",
    "height": "200",
    "mass": "140",
    "hair_color": "none",
    "skin_color": "metal",
    "eye_color": "red",
    "birth_year": "15BBY",
    "gender": "none",
    "homeworld": "28",
    "films": ["2"]
  },
  {
    "_id": "24",
    "name": "Bossk",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_bossk_01_169_c3c42fbe.jpeg?region=0%2C0%2C1560%2C878",
    "description": "One of the most feared bounty hunters of the galaxy, Bossk used his natural Trandoshan hunting instincts to capture his prey. During the Clone Wars, the red-eyed reptilian partnered with Aurra Sing, Castas and young Boba Fett. Bossk didn't care much for vendettas or politics. He was in it to get paid. After a brief stint in a Republic prison, Bossk continued his partnership with Fett, becoming a bodyguard to the teen bounty hunter. Decades later, Bossk answered Darth Vader's call to capture the Millennium Falcon after the Battle of Hoth, an assignment that put him in direct competition with Boba.",
    "height": "190",
    "mass": "113",
    "hair_color": "none",
    "skin_color": "green",
    "eye_color": "red",
    "birth_year": "53BBY",
    "gender": "male",
    "homeworld": "29",
    "films": ["2"]
  },
  {
    "_id": "25",
    "name": "Lando Calrissian",
    "image": "https://lumiere-a.akamaihd.net/v1/images/lando-main_a207290e.jpeg?region=147%2C0%2C951%2C536",
    "description": "Lando Calrissian may have come late to the fight against the Empire, but his role in destroying the second Death Star cemented his reputation as a hero. In his youth, Lando was a sportsman seeking a fortune at the sabacc tables. After he lost his beloved ship to Han Solo, Lando spent years living the high life and pursuing get-rich-quick schemes, with uneven results. He went semi-respectable as the baron administrator of Cloud City, only to be drawn into the fight against the Empire. After a personal tragedy, Lando sought solace in isolation on Pasaana, unaware that the galaxy would need him again.",
    "height": "177",
    "mass": "79",
    "hair_color": "black",
    "skin_color": "dark",
    "eye_color": "brown",
    "birth_year": "31BBY",
    "gender": "male",
    "homeworld": "30",
    "films": ["2", "3"]
  },
  {
    "_id": "26",
    "name": "Lobot",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_lobot_01_169_8a50d7ae.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Never far from Baron Administrator Lando Calrissian's side was Lobot, Calrissian's aide and Cloud City's computer liaison officer. Lobot is a human male with a shiny, brain-enhancing device wrapped around the back of his skull that allowed him to contact directly with the city's central computer.",
    "height": "175",
    "mass": "79",
    "hair_color": "none",
    "skin_color": "light",
    "eye_color": "blue",
    "birth_year": "37BBY",
    "gender": "male",
    "homeworld": "6",
    "films": ["2"]
  },
  {
    "_id": "27",
    "name": "Ackbar",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_ackbar_01_169_55137220.jpeg?region=0%2C0%2C1560%2C878",
    "description": "A veteran commander, Ackbar led the defense of his homeworld, Mon Cala, during the Clone Wars and then masterminded the rebel attack on the second Death Star at the Battle of Endor. Ackbar realized the rebels had been drawn into a trap at Endor, but adjusted, with his fleet buying valuable time for the attack to succeed. After the Battle of Endor, Ackbar became a Grand Admiral in the New Republic, winning many victories including the pivotal Battle of Jakku. He retired to Mon Cala, but was coaxed back into service with the Resistance by Leia Organa.",
    "height": "180",
    "mass": "83",
    "hair_color": "none",
    "skin_color": "brown mottle",
    "eye_color": "orange",
    "birth_year": "41BBY",
    "gender": "male",
    "homeworld": "31",
    "films": ["3"]
  },
  {
    "_id": "28",
    "name": "Mon Mothma",
    "image": "https://lumiere-a.akamaihd.net/v1/images/mon-mothma-main_06f17008.jpeg?region=243%2C0%2C1427%2C803",
    "description": "Working in secret as one of the founders of the Rebel Alliance, Senator Mon Mothma of Chandrila carefully navigates the dangerous shadows of Coruscant politics in her efforts to build a viable rebellion. Once a leader of the Galactic Senate's Loyalist faction, Mon Mothma opposed Supreme Chancellor Palpatine's policies during the final days of the Republic. After the rise of the Empire, Mothma continues to serve her constituents on Coruscant while working on her ultimate goal: the Alliance to Restore the Republic.",
    "height": "150",
    "mass": "unknown",
    "hair_color": "auburn",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "48BBY",
    "gender": "female",
    "homeworld": "32",
    "films": ["3"]
  },
  {
    "_id": "29",
    "name": "Arvel Crynyd",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT9Eukoi4j3s1CMgqxtgO050DMbJ7Xw1Mf9y7IIaI8UbKBUbnbfvLdX1MPnQpjSoEtCyio&usqp=CAU",
    "description": "During the Battle of Endor, A-wing pilot Arvel Crynyd used the reinforced heat shield on his starfighter's prow as a battering ram, plowing into the bridge of Darth Vader's command ship, the Executor",
    "height": "unknown",
    "mass": "unknown",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "brown",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "28",
    "films": ["3"]
  },
  {
    "_id": "30",
    "name": "Wicket Systri Warrick",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_wickettwwarrick_01_169_86d1210c.jpeg?region=0%2C3%2C1560%2C780",
    "description": "Wicket W. Warrick was the brave young Ewok who willingly joined the Rebellion and aided in the battle against the Empire on the forest moon of Endor. Even before he encountered the Rebels, Wicket had devised methods for defeating the Imperial machines, plans which were implemented after the Ewok befriended Princess Leia and recruited his tribe to the Alliance's cause. During the Battle of Endor, Wicket fought valiantly alongside his new allies.",
    "height": "88",
    "mass": "20",
    "hair_color": "brown",
    "skin_color": "brown",
    "eye_color": "brown",
    "birth_year": "8BBY",
    "gender": "male",
    "homeworld": "7",
    "films": ["3"]
  },
  {
    "_id": "31",
    "name": "Nien Nunb",
    "image": "https://lumiere-a.akamaihd.net/v1/images/nien-nunb-main_1dbef681.jpeg?region=0%2C58%2C1281%2C720",
    "description": "A native of Sullust, Nien Nunb was a smuggler who fought for both the Rebel Alliance and the Resistance during his long career. An expert pilot, he served as Lando Calrissian’s co-pilot aboard the Millennium Falcon during the Battle of Endor, flew an X-wing in the raid on Starkiller Base and survived the First Order’s assault on Crait. He was then killed fighting for freedom at Exegol.",
    "height": "160",
    "mass": "68",
    "hair_color": "none",
    "skin_color": "grey",
    "eye_color": "black",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "33",
    "films": ["3"]
  },
  {
    "_id": "32",
    "name": "Qui-Gon Jinn",
    "image": "https://lumiere-a.akamaihd.net/v1/images/qui-gon-jinn-main_3386f119.jpeg?region=296%2C3%2C937%2C527",
    "description": "A venerable if maverick Jedi Master, Qui-Gon Jinn was a student of the living Force. Qui-Gon lived for the moment, espousing a philosophy of 'feel, don't think -- use your instincts.' On Tatooine, Qui-Gon discovered a young slave boy named Anakin Skywalker who was strong in the Force. Sensing the boy's potential, Qui-Gon liberated Anakin from slavery. The Jedi Master presented Anakin to the Jedi Council, but they deemed the boy too old to begin training and dangerously full of fear and anger. They refused to allow Qui-Gon to train Anakin, but rescinded their decision to fulfill Qui-Gon's dying wish.",
    "height": "193",
    "mass": "89",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "92BBY",
    "gender": "male",
    "homeworld": "28",
    "films": ["4"]
  },
  {
    "_id": "33",
    "name": "Nute Gunray",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_nutegunray_01_169_9d66ded2.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Neimoidians are known for their business skills, but Nute Gunray, Viceroy of the Trade Federation, was more cutthroat than most. It was Gunray who conspired with the Sith Lord Darth Sidious to launch the blockade and subsequent invasion of Naboo. Once the planet was under siege, Gunray attempted to force Queen Amidala to sign a treaty that would legitimize the occupation. Amidala escaped, and returned to infiltrate her own palace and blast through Gunray's protectors. Arrested by Republic officials, Gunray was carted off to answer for his crimes, but evaded imprisonment and kept his post.",
    "height": "191",
    "mass": "90",
    "hair_color": "none",
    "skin_color": "mottled green",
    "eye_color": "red",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "18",
    "films": ["4", "5", "6"]
  },
  {
    "_id": "34",
    "name": "Finis Valorum",
    "image": "https://lumiere-a.akamaihd.net/v1/images/valorum_a31904f4.jpeg?region=200%2C0%2C1698%2C955",
    "description": "A well-meaning civil servant whose chancellorship was hampered by corruption in the Senate and bureaucratic snarls, Valorum secretly turned to the Jedi Knights for help breaking the Trade Federation's blockade of Naboo. But Valorum was betrayed by Naboo's Senator Palpatine, who maneuvered Queen Amidala into asking the Senate for a no-confidence vote in the Supreme Chancellor's leadership. A stunned Valorum was removed from office in favor of Palpatine.",
    "height": "170",
    "mass": "unknown",
    "hair_color": "blond",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "91BBY",
    "gender": "male",
    "homeworld": "9",
    "films": ["4"]
  },
  {
    "_id": "35",
    "name": "Padmé Amidala",
    "image": "https://lumiere-a.akamaihd.net/v1/images/Padme-Amidala_05d50c8a.jpeg?region=0%2C0%2C1536%2C864",
    "description": "Padmé Amidala was a courageous, hopeful leader, serving as Queen and then Senator of Naboo -- and was also handy with a blaster. Despite her ideals and all she did for the cause of peace, her secret, forbidden marriage to Jedi Anakin Skywalker would prove to have dire consequences for the galaxy.",
    "height": "185",
    "mass": "45",
    "hair_color": "brown",
    "skin_color": "light",
    "eye_color": "brown",
    "birth_year": "46BBY",
    "gender": "female",
    "homeworld": "8",
    "films": ["4", "5", "6"]
  },
  {
    "_id": "36",
    "name": "Jar Jar Binks",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_jarjarbinks_01_169_c70767ab.jpeg?region=0%2C0%2C1560%2C878",
    "description": "A clumsy, well-meaning Gungan outcast on Naboo, Jar Jar Binks struggled to prove his worth throughout his life. Putting his awkward past behind him, Jar Jar left the swamps of Naboo to enter the even murkier waters of Coruscant politics, becoming a representative for his people in the galactic capital. There, his best intentions and eagerness to serve were exploited by scheming Senators and others in positions of power.",
    "height": "196",
    "mass": "66",
    "hair_color": "none",
    "skin_color": "orange",
    "eye_color": "orange",
    "birth_year": "52BBY",
    "gender": "male",
    "homeworld": "8",
    "films": ["4", "5"]
  },
  {
    "_id": "37",
    "name": "Roos Tarpals",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_generaltarpals_01_169_cb2134d2.jpeg?region=0%2C0%2C1560%2C878",
    "description": "The gravelly-voiced patrol chief of Otoh Gunga, Tarpals has endured many a headache caused by the antics of Jar Jar Binks. Tarpals kept an eye on the bumbling outcast, making sure the youngster didn't re-enter Gungan society. During the Trade Federation occupation of Naboo, Tarpals was part of the Gungan Grand Army that fought against the battle droid invaders. Ironically, Tarpals served under Binks, who had unexpectedly received the rank of general by Boss Nass himself. Tarpals stayed close to Binks, trying to keep his commanding officer out of trouble. By the time of the Clone Wars, Tarpals was promoted to general, and served as leader of the Gungan Grand Army.",
    "height": "224",
    "mass": "82",
    "hair_color": "none",
    "skin_color": "grey",
    "eye_color": "orange",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "8",
    "films": ["4"]
  },
  {
    "_id": "38",
    "name": "Rugor Nass",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_bossnass_01_169_ef11c0db.jpeg?region=0%2C0%2C1560%2C878",
    "description": "The stout and stern leader of the Gungans, Boss Nass was a proud keeper of his people's ways. His booming voice issued decrees on behalf of all the Gungans of Otoh Gunga. He kept a tight rein on Gungan affairs, continuing a longstanding custom of isolationism. Though Nass' temper is short, displays of courage and humility can pierce through his preconceptions. When Queen Amidala prostrated herself before the Gungan leader to request his aid in fighting off the Trade Federation invasion, he was impressed. Nass committed the Gungan Grand Army to wage war against invading battle droids.",
    "height": "206",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "green",
    "eye_color": "orange",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "8",
    "films": ["4"]
  },
  {
    "_id": "39",
    "name": "Ric Olié",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_ricolie_01_169_f175f81b.jpeg?region=0%2C0%2C1560%2C878",
    "description": "A veteran of the Naboo Space Fighter Corps, Ric Olie was the leader of Bravo Flight and had the honor of flying Queen Amidala's Royal Starship to and from Naboo. Answerable directly to Captain Panaka, Olie was capable of flying any craft on Naboo. During the Battle of Naboo, Olie's squadron of N-1 starfighters were successful in destroying the Trade Federation's Droid Control Ship with the help of Anakin Skywalker.",
    "height": "183",
    "mass": "unknown",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "8",
    "films": ["4"]
  },
  {
    "_id": "40",
    "name": "Watto",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_watto_01_169_ecd563f1.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Watto was a Toydarian junk dealer in Mos Espa who bought Shmi Skywalker and her son Anakin from Gardulla the Hutt. An inveterate gambler, he sponsored Anakin in several Podraces, but often bet against his own slave, who was talented but inexperienced. Watto lost Anakin to Qui-Gon Jinn in a wager on the Boonta Eve race. Years later, he sold Shmi to the moisture farmer Cliegg Lars.",
    "height": "137",
    "mass": "unknown",
    "hair_color": "black",
    "skin_color": "blue, grey",
    "eye_color": "yellow",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "34",
    "films": ["4", "5"]
  },
  {
    "_id": "41",
    "name": "Sebulba",
    "image": "https://lumiere-a.akamaihd.net/v1/images/sebulba_1f3fe180.jpeg?region=0%2C0%2C2453%2C1380",
    "description": "A crafty, vicious Dug, Sebulba became one of the Outer Rim's most successful Podracers. Whether roaming the streets of Mos Espa or piloting his massive orange Podracer, Sebulba was aggressive and arrogant. He was not above cheating to win a race, and would even resort to illegal weapons in an attempt to defeat his opponents. Sebulba was Mos Espa's reigning Podrace champion until he entered the Boonta Eve Classic, where he was defeated by young Anakin Skywalker, much to the Dug's frustration.",
    "height": "112",
    "mass": "40",
    "hair_color": "none",
    "skin_color": "grey, red",
    "eye_color": "orange",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "35",
    "films": ["4"]
  },
  {
    "_id": "42",
    "name": "Quarsh Panaka",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_captainpanaka_01_169_6a3ccac5.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Queen Amidala's loyal protector during the Trade Federation invasion crisis was Captain Panaka. Panaka was often referred to as 'the quickest eyes on Naboo' for his attention to detail and selfless dedication to the safety of the Queen. Panaka commanded a team of Royal Palace Guards and Security Troopers stationed throughout Theed. During the Trade Federation invasion, Panaka stayed close to the Queen, ensuring her protection from the Neimoidians' plans. His loyalty was such that he would openly question the strategy of Jedi Knights if he thought it would somehow endanger Amidala.",
    "height": "183",
    "mass": "unknown",
    "hair_color": "black",
    "skin_color": "dark",
    "eye_color": "brown",
    "birth_year": "62BBY",
    "gender": "male",
    "homeworld": "8",
    "films": ["4"]
  },
  {
    "_id": "43",
    "name": "Shmi Skywalker",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_shmiskywalkerlars_01_169_7449f0a8.jpeg?region=0%2C0%2C1560%2C878",
    "description": "The mother of Anakin Skywalker was also a brave and resilient woman who survived life as a slave to become a Tatooine moisture farmer. Shmi surrendered her son to the Jedi Order, putting him on a path to become one of the greatest Jedi. Her death at the hands of Tusken Raiders became a critical step on Anakin's journey to the dark side.",
    "height": "163",
    "mass": "unknown",
    "hair_color": "black",
    "skin_color": "fair",
    "eye_color": "brown",
    "birth_year": "72BBY",
    "gender": "female",
    "homeworld": "1",
    "films": ["4", "5"]
  },
  {
    "_id": "44",
    "name": "Darth Maul",
    "image": "https://lumiere-a.akamaihd.net/v1/images/Darth-Maul_632eb5af.jpeg?region=75%2C42%2C1525%2C858",
    "description": "A deadly, agile Sith Lord trained by the evil Darth Sidious, Darth Maul was a formidable warrior and scheming mastermind. He wielded an intimidating double-bladed lightsaber and fought with a menacing ferocity. Though he fell in battle against Obi-Wan Kenobi, the Zabrak from Dathomir would prove to be much harder to destroy than originally believed.",
    "height": "175",
    "mass": "80",
    "hair_color": "none",
    "skin_color": "red",
    "eye_color": "yellow",
    "birth_year": "54BBY",
    "gender": "male",
    "homeworld": "36",
    "films": ["4"]
  },
  {
    "_id": "45",
    "name": "Bib Fortuna",
    "image": "https://lumiere-a.akamaihd.net/v1/images/bib-fortuna-main_376ba1ba.jpeg?region=304%2C0%2C1778%2C1000",
    "description": "As the former majordomo to the late Jabba the Hutt, the scheming Bib Fortuna seized power after his master's demise and attempted to control the criminal underworld on Tatooine. For decades, those attempting to do business with Jabba the Hutt first needed to maneuver past the Twi'lek, an ever-present attendant who often hovered near Jabba's ear, offering advice and feeding his boss information. Fortuna followed the rules of protocol in the Hutt's court (such as they were), and spoke only in Huttese, though he understood other tongues.",
    "height": "180",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "pale",
    "eye_color": "pink",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "37",
    "films": ["3"]
  },
  {
    "_id": "46",
    "name": "Ayla Secura",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_aaylasecura_01_169_39a65af2.jpeg?region=0%2C0%2C1560%2C878",
    "description": "With an athletic build, an exotic beauty, and blue skin, Aayla Secura stood out among the many faces of the Jedi ranks. A cunning warrior and Jedi Knight during the rise of the Clone Wars, Aayla fought alongside Clone Commander Bly on many exotic battlefields. Having mastered the emotional detachment necessary in the Jedi Order, she always tried to pass on what she had learned to others. Aayla was killed, along with many other Jedi Generals, when her troops turned on her in reaction to Supreme Chancellor Palpatine’s broadcast of Order 66.",
    "height": "178",
    "mass": "55",
    "hair_color": "none",
    "skin_color": "blue",
    "eye_color": "hazel",
    "birth_year": "48BBY",
    "gender": "female",
    "homeworld": "37",
    "films": ["4", "5", "6"]
  },
  {
    "_id": "47",
    "name": "Ratts Tyerel",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_rattstyerell_01_169_031aea6d.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Ratts Tyerell was the tiniest of the Podracer pilots in the Boonta Eve Classic, though size matters not in such a competition. The little scrapper piloted a Podracer with immense engines ... too big, it would seem, for the tight confines of the Laguna Caves. On the second lap of the race, Ratts' accelerator jammed, and he couldn't get clearance past the rocky stalactites. The resulting fireball killed the little guy. His family, who had traveled to Mos Espa to witness the race, was reportedly seen grieving shortly thereafter.",
    "height": "79",
    "mass": "15",
    "hair_color": "none",
    "skin_color": "grey, blue",
    "eye_color": "unknown",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "38",
    "films": ["4"]
  },
  {
    "_id": "48",
    "name": "Dud Bolt",
    "image": "https://static.wikia.nocookie.net/esstarwars/images/a/a6/Bolt.jpg/revision/latest?cb=20101012012932",
    "description": "Dud Bolt was a Vulptereen male from the planet Vulpter who worked as a podracer pilot and hitman. He flew a Vulptereen 327 and served as a mid-air bodyguard for the Dug podracer Sebulba. In 32 BBY, he participated in the Boonta Eve Classic race on the planet Tatooine.",
    "height": "94",
    "mass": "45",
    "hair_color": "none",
    "skin_color": "blue, grey",
    "eye_color": "yellow",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "39",
    "films": ["4"]
  },
  {
    "_id": "49",
    "name": "Gasgano",
    "image": "https://lumiere-a.akamaihd.net/v1/images/gasgano_6f648f83.jpeg?region=0%2C48%2C2252%2C1267",
    "description": "A slight, spindly, six-limbed alien, Gasgano was a thrill-seeker uniquely suited to the extreme sport of Podracing. Gasgano was very competitive, and sought to beat racers Anakin Skywalker and Sebulba during the Boonta Eve Podrace. He piloted a green Ord Pedrovia Podracer in the competition.",
    "height": "122",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "white, blue",
    "eye_color": "black",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "40",
    "films": ["4"]
  },
  {
    "_id": "50",
    "name": "Ben Quadinaros",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_benquadinaros_01_169_0c77b6a0.jpeg?region=0%2C0%2C1560%2C878",
    "description": "The pudgy, comic-faced Ben Quadinaros was a rookie Podracer who claimed he came from the mysterious Tund system. He competed in the Boonta Eve Podrace that saw the liberation of Anakin Skywalker from slavery. Ben was largely inexperienced, and was quite terrified of the Boonta race. At the start of the race, his engines wouldn't even ignite. It was not until most of his competitors were already heading towards their second lap that his four engines did light -- just as his power couplings shorted, sending the rockets flying about the arena.",
    "height": "163",
    "mass": "65",
    "hair_color": "none",
    "skin_color": "grey, green, yellow",
    "eye_color": "orange",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "41",
    "films": ["4"]
  },
  {
    "_id": "51",
    "name": "Mace Windu",
    "image": "https://lumiere-a.akamaihd.net/v1/images/Mace-Windu_b35242e5.jpeg?region=0%2C0%2C1637%2C921",
    "description": "A grim Jedi Master with an amethyst-bladed lightsaber, Mace Windu was the champion of the Jedi Order, with little tolerance for the failings of the Senate, the arguments of politicians, or the opinions of rebellious Jedi. As the Clone Wars intensified, Mace sensed the dark side of the Force at work, and knew the Jedi's enemies were plotting to destroy the Order and end its stewardship of the galaxy.",
    "height": "188",
    "mass": "84",
    "hair_color": "none",
    "skin_color": "dark",
    "eye_color": "brown",
    "birth_year": "72BBY",
    "gender": "male",
    "homeworld": "42",
    "films": ["4", "5", "6"]
  },
  {
    "_id": "52",
    "name": "Ki-Adi-Mundi",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_kiadimundi_01_169_0a8842d3.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Ki-Adi-Mundi was a Cerean alien who sat on the Jedi Council. A humanoid being, Ki's most distinguishing physical feature was an enlarged conical cranium that contained a binary brain. When Jedi Master Qui-Gon Jinn reported a Sith attack during the events surrounding the Battle of Naboo, Ki-Adi-Mundi expressed shock at the notion. 'Impossible', he remarked, 'the Sith have been extinct for a millennium.' He also failed to see how far Count Dooku had fallen from the Jedi ideals just prior to the Clone Wars, believing that Dooku was incapable of violence or murder.",
    "height": "198",
    "mass": "82",
    "hair_color": "white",
    "skin_color": "pale",
    "eye_color": "yellow",
    "birth_year": "92BBY",
    "gender": "male",
    "homeworld": "43",
    "films": ["4", "5", "6"]
  },
  {
    "_id": "53",
    "name": "Kit Fisto",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_kitfisto_01_169_21517d01.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Kit Fisto is a striking example of an alien Jedi, a Nautolan with large eyes, and a gathered tangle of flexible tentacle-tresses extending from his head. He is at home in the waters of aquatic planets, like his native Glee Anselm. As a Jedi Master, Fisto has an intense focus, particularly in combat. He is also much more laid back and capable of enjoying a hearty chuckle than some of his humorless colleagues.",
    "height": "196",
    "mass": "87",
    "hair_color": "none",
    "skin_color": "green",
    "eye_color": "black",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "44",
    "films": ["4", "5", "6"]
  },
  {
    "_id": "54",
    "name": "Eeth Koth",
    "image": "https://lumiere-a.akamaihd.net/v1/images/Eeth-Koth2_246ea172.jpeg?region=126%2C0%2C1010%2C568",
    "description": "Eeth Koth was a member of the Jedi High Council in the final years of the order. From within the polished towers of the Jedi Temple on Coruscant, the Council governed the actions of the Jedi Knights. Koth was one of the 12 Jedi present when Qui-Gon Jinn presented Anakin Skywalker as the Chosen One to the Council. A determined warrior with a deep, spiritual connection to the Force, Koth resisted torture at the hands of General Grievous during the Clone Wars, and was even able to secretly communicate his location to the Jedi Council. Koth was saved from Separatist clutches by the daring efforts of his fellow Jedi.",
    "height": "171",
    "mass": "unknown",
    "hair_color": "black",
    "skin_color": "brown",
    "eye_color": "brown",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "45",
    "films": ["4", "6"]
  },
  {
    "_id": "55",
    "name": "Adi Gallia",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_adigallia_169_8b798f27.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Jedi Master Adi Gallia was a member of the Order's High Council during the Clone Wars. She and the other members of that ruling body would convene in a temple high above the Coruscant landscape, deciding important matters of the Jedi. Stern and focused, she would remark upon the more outrageous tactics carried out by Anakin Skywalker or Obi-Wan Kenobi in the course of the war, but would rarely condemn their effective actions. Though not as brash as Anakin, Adi Gallia was known to be an aggressive warrior who had no problem bringing the fight to the enemy.",
    "height": "184",
    "mass": "50",
    "hair_color": "none",
    "skin_color": "dark",
    "eye_color": "blue",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "9",
    "films": ["4", "6"]
  },
  {
    "_id": "56",
    "name": "Saesee Tiin",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_saeseetiin_01_169_c9a8a41c.jpeg?region=0%2C0%2C1560%2C878",
    "description": "The imposing Saesee Tiin was a member of the Jedi Council during the final years of the Republic. In addition to being a skilled, courageous master of the lightsaber, he was also a capable starfighter pilot. Tiin voyaged to Naboo to attend the funeral of fallen Jedi Qui-Gon Jinn, and the jubilant celebration that marked the liberation of that outlying world. Ten years after this event, Tiin was still an active member of the Jedi order, and a vital battlefield general in the Clone Wars.",
    "height": "188",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "pale",
    "eye_color": "orange",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "47",
    "films": ["4", "6"]
  },
  {
    "_id": "57",
    "name": "Yarael Poof",
    "image": "https://lumiere-a.akamaihd.net/v1/images/screen_shot_2015-08-03_at_10_b0b47660.jpeg?region=0%2C361%2C1560%2C878",
    "description": "A gaunt, long-necked Quermian, Yarael Poof had two brains and four arms, which he kept hidden beneath his Jedi robes. Poof was a member of the Jedi Council during the final years of the Republic, and was in the Jedi Council Chamber when Qui-Gon Jinn returned from Tatooine with the extraordinary news that the ancient Sith had returned to challenge the Jedi once more.",
    "height": "264",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "white",
    "eye_color": "yellow",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "48",
    "films": ["4"]
  },
  {
    "_id": "58",
    "name": "Plo Koon",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_plokoon_01_169_92e6679c.jpeg?region=0%2C0%2C1560%2C878",
    "description": "A Kel Dor from Dorin, Plo Koon was among the wisest members of the Jedi Order, respected for his level-headed analysis of events and unflappable calm. Deeply concerned for life in all its myriad forms, Plo was especially devoted to protecting the clones under his command. He shared a special bond with Ahsoka Tano, whom he’d brought to the Jedi Order as a toddler. One of many victims of Order 66, Master Plo died at Cato Neimoidia when his wingmen shot down his starfighter.",
    "height": "188",
    "mass": "80",
    "hair_color": "none",
    "skin_color": "orange",
    "eye_color": "black",
    "birth_year": "22BBY",
    "gender": "male",
    "homeworld": "49",
    "films": ["4", "5", "6"]
  },
  {
    "_id": "59",
    "name": "Mas Amedda",
    "image": "https://lumiere-a.akamaihd.net/v1/images/mas-amedda-main_3e450a61.jpeg?region=237%2C0%2C1445%2C813",
    "description": "Mas Amedda was the Vice Chair of the Galactic Senate during Chancellor Valorum's term, a position he continued to hold as Chancellor Palpatine transformed the Republic into the Galactic Empire. Amedda's booming voice often called for order when the partisan nature of the Republic's government degenerated into pointless bickering. In an alien gesture of authority, he would often punctuate such calls with a flicker of his long, forked tongue.",
    "height": "196",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "blue",
    "eye_color": "blue",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "50",
    "films": ["4", "5"]
  },
  {
    "_id": "60",
    "name": "Gregar Typho",
    "image": "https://lumiere-a.akamaihd.net/v1/images/captain-typho_f9e8d7bd.jpeg?region=0%2C0%2C1186%2C668",
    "description": "Gregar Typho succeeded Captain Panaka as head of Padmé Amidala’s security detail, protecting her as Naboo’s queen and then as its Senator. During the Separatist Crisis, Typho endorsed the plan for Padmé to evade assassins by secretly returning to Naboo with Anakin Skywalker. He loyally defended the Senator against a host of enemies in the Clone Wars.",
    "height": "185",
    "mass": "85",
    "hair_color": "black",
    "skin_color": "dark",
    "eye_color": "brown",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "8",
    "films": ["5"]
  },
  {
    "_id": "61",
    "name": "Cordé",
    "image": "https://static.wikia.nocookie.net/starwars/images/e/e5/Corde-SWCT.png/revision/latest?cb=20160713053607",
    "description": "Cordé, formerly known as Cordyn, was a handmaiden who served Senator Padmé Amidala in the days leading up to the Clone Wars. She was acting as a decoy when she was killed in an attempt on Amidala's life by Clawdite bounty hunter Zam Wesell.",
    "height": "157",
    "mass": "unknown",
    "hair_color": "brown",
    "skin_color": "light",
    "eye_color": "brown",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "8",
    "films": ["5"]
  },
  {
    "_id": "62",
    "name": "Cliegg Lars",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_cliegglars_01_169_c2f0b9cb.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Cliegg Lars was a modest, good-hearted moisture farmer who lived on the Lars homestead, not far from the township of Anchorhead. During a trip to the bustling spaceport of Mos Espa, Cliegg fell in love with Shmi Skywalker, a slave owned by Toydarian junk trader Watto. Cliegg purchased Shmi's freedom and, soon after, made her his bride. They lived a quiet existence for years on the homestead, surviving against the harsh desert elements. With Owen, Cliegg's son from a previous union, and Owen's girlfriend Beru Whitesun, the Lars homestead was a tiny island of familial warmth amidst the endless desert wastes. Until tragedy struck...",
    "height": "183",
    "mass": "unknown",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "82BBY",
    "gender": "male",
    "homeworld": "1",
    "films": ["5"]
  },
  {
    "_id": "63",
    "name": "Poggle the Lesser",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_pogglethelesser_01_169_7095ae3c.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Poggle the Lesser was the leader of the insect-like Geonosians throughout the era of the Clone Wars. Due to his control of the Geonosian battle droid factories, he was a powerful figure within the Confederacy of Independent Systems and commanded the droid armies that fought against the Republic in two battles for control of Geonosis. At the end of the war, Poggle lost his life to Darth Vader.",
    "height": "183",
    "mass": "80",
    "hair_color": "none",
    "skin_color": "green",
    "eye_color": "yellow",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "11",
    "films": ["5", "6"]
  },
  {
    "_id": "64",
    "name": "Luminara Unduli",
    "image": "https://lumiere-a.akamaihd.net/v1/images/luminara_c05b2971.jpeg?region=0%2C0%2C1601%2C901",
    "description": "A green-skinned Mirialan, Luminara Unduli served the Jedi Order during the final years of the Galactic Republic, and trained the capable Padawan Barriss Offee. A no-nonsense Jedi Master, Luminara fought in Clone Wars battles such as Geonosis and Kashyyyk, and was thought to have perished during Order 66. In reality, she’d been taken into Imperial custody and executed, with holographic transmissions of her captivity used as bait to capture fugitive Jedi.",
    "height": "170",
    "mass": "56.2",
    "hair_color": "black",
    "skin_color": "yellow",
    "eye_color": "blue",
    "birth_year": "58BBY",
    "gender": "female",
    "homeworld": "51",
    "films": ["5", "6"]
  },
  {
    "_id": "65",
    "name": "Barriss Offee",
    "image": "https://lumiere-a.akamaihd.net/v1/images/Barriss-Offee-main-image_a4f0cc76.jpeg?region=87%2C0%2C1460%2C821",
    "description": "The Mirialan Padawan to Luminara Unduli, Barriss Offee preferred learning and studying ancient Jedi texts in the Temple to war. This mindset, while noble, led her down a dark path that saw her betray friends and commit terrible acts.",
    "height": "166",
    "mass": "50",
    "hair_color": "black",
    "skin_color": "yellow",
    "eye_color": "blue",
    "birth_year": "40BBY",
    "gender": "female",
    "homeworld": "51",
    "films": ["5"]
  },
  {
    "_id": "66",
    "name": "Dormé",
    "image": "https://lumiere-a.akamaihd.net/v1/images/dorme-2_dd1590e9.jpeg?region=781%2C333%2C1186%2C667",
    "description": "Despite no longer being Naboo’s queen, Padmé Amidala retained some royal perks as senator. Among them were her loyal handmaidens – a name that did little justice to the women’s training as bodyguards. Padmé’s most devoted aide, Dormé, advised the senator on Coruscant and helped look after Naboo’s affairs when Padmé retreated to her homeworld with Anakin Skywalker.",
    "height": "165",
    "mass": "unknown",
    "hair_color": "brown",
    "skin_color": "light",
    "eye_color": "brown",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "8",
    "films": ["5"]
  },
  {
    "_id": "67",
    "name": "Dooku",
    "image": "https://lumiere-a.akamaihd.net/v1/images/Count-Dooku_4f552149.jpeg?region=0%2C0%2C1436%2C808",
    "description": "Count Dooku was a menacing Sith Lord and central figure in the Clone Wars. Once a Jedi -- trained by Yoda -- he became disillusioned with the Jedi Order and thirsted for greater power. Dooku voluntarily left the light side behind and became Darth Sidious’ dark side disciple, taking the secret name Darth Tyranus and leading the Separatist army. Dooku advanced Sidious’s secret plot to take over the galaxy, but forgot that betrayal is the nature of the Sith.",
    "height": "193",
    "mass": "80",
    "hair_color": "white",
    "skin_color": "fair",
    "eye_color": "brown",
    "birth_year": "102BBY",
    "gender": "male",
    "homeworld": "52",
    "films": ["5", "6"]
  },
  {
    "_id": "68",
    "name": "Bail Prestor Organa",
    "image": "https://lumiere-a.akamaihd.net/v1/images/obi-wan-kenobi-story-gallery-part-1-09_7d0d1480.jpeg?region=36%2C0%2C951%2C536",
    "description": "A member of Alderaan's royal family and the planet's representative to the Republic Senate since the time of the Clone Wars, Bail Organa earned respect on Coruscant for his honesty and his commitment to justice. Prior to the fall of the Republic, Bail served alongside Senator Padmé Amidala as a member of Chancellor Palpatine's Loyalist Committee. The two became close friends, and recruited like-minded allies to prevent Palpatine's alarming grabs for power. At the end of the war, Bail Organa adopted Padmé's daughter Leia and raised her as an Alderaanian princess. While representing Alderaan in the Imperial Senate, he continued to work secretly with allies such as Mon Mothma and Ahsoka Tano to assist rebel cells scattered across the galaxy, working towards the day that a unified Rebellion could emerge.",
    "height": "191",
    "mass": "unknown",
    "hair_color": "black",
    "skin_color": "tan",
    "eye_color": "brown",
    "birth_year": "67BBY",
    "gender": "male",
    "homeworld": "2",
    "films": ["5", "6"]
  },
  {
    "_id": "69",
    "name": "Jango Fett",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_jangofett_01_169_884cefab.jpeg?region=0%2C0%2C1560%2C878",
    "description": "In the final years of the Republic, Jango Fett was regarded as the best bounty hunter in the galaxy. A proficient marksman and unarmed combatant, Fett was covered in a sleek armored suit that concealed his scarred face. His combat gear featured an arsenal of weaponry, including retractable wrist blades, a snare, dual blaster pistols and other more exotic tools of the trade. In combat, Jango used his harnessed jetpack to gain the advantage of speed and height over his enemies. The backpack also carried a nasty surprise -- an explosive rocket could be launched from it. For interstellar travel, Jango traveled aboard his well-worn starship, Slave I.",
    "height": "183",
    "mass": "79",
    "hair_color": "black",
    "skin_color": "tan",
    "eye_color": "brown",
    "birth_year": "66BBY",
    "gender": "male",
    "homeworld": "53",
    "films": ["5"]
  },
  {
    "_id": "70",
    "name": "Zam Wesell",
    "image": "https://lumiere-a.akamaihd.net/v1/images/zam-wesell_bbaffe9f.jpeg?region=190%2C0%2C1180%2C664",
    "description": "A shape-shifting Clawdite assassin from Zolan, Zam Wesell could assume any humanoid form. Jango Fett hired her to kill Padmé Amidala on Coruscant, but the Naboo Senator eluded an explosive that destroyed her starship, then escaped poisonous kouhuns let loose in her apartment. Anakin Skywalker and Obi-Wan Kenobi pursued Zam across Coruscant, catching her in the Outlander Club. Before she could talk, Jango shot her dead with a Kaminoan saberdart.",
    "height": "168",
    "mass": "55",
    "hair_color": "blonde",
    "skin_color": "fair, green, yellow",
    "eye_color": "yellow",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "54",
    "films": ["5"]
  },
  {
    "_id": "71",
    "name": "Dexter Jettster",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_dexterjettster_01_169_09c89b71.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Obi-Wan Kenobi counted on Dexter Jettster, an old friend, to identify a poison dart, and Jettster didn't fail him. The cook correctly recognized the small-tined projectile as a Kamino saberdart. Few have ever heard of the planet Kamino, but Dex not only informed Obi-Wan as to its location (12 parsecs south of the Rishi Maze), but also its inhabitants. Dex warned that the native Kaminoans -- cloners of some repute -- keep to themselves, but are welcoming to those with the credits to spare.",
    "height": "198",
    "mass": "102",
    "hair_color": "none",
    "skin_color": "brown",
    "eye_color": "yellow",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "55",
    "films": ["5"]
  },
  {
    "_id": "72",
    "name": "Lama Su",
    "image": "https://lumiere-a.akamaihd.net/v1/images/lama-su-main_63f653f9.jpeg?region=277%2C70%2C1320%2C743",
    "description": "An ancient creature accidentally unearthed on Malastare during an intense battle of the Clone Wars, the zillo beast was a monster of legend. The enormous animal proved to be nearly invulnerable to Republic weaponry, prompting intense interest from then-Chancellor Palpatine. At his order, the creature was incapacitated and transported to a secure research facility on Coruscant, before it broke free and terrorized the capital. In the era of the Empire, Emperor Palpatine's scientists continue to work on harnessing the species' natural gifts, with disastrous consequences. On one occasion, an Imperial craft carrying a modified version of the creature crash-landed on the world of Silla, leaving the modified zillo to blindly hunt for power sources, gulping at energy conduits to propel its rapid growth, and feasting on one of the planet's solar farms.",
    "height": "229",
    "mass": "88",
    "hair_color": "none",
    "skin_color": "grey",
    "eye_color": "black",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "10",
    "films": ["5"]
  },
  {
    "_id": "73",
    "name": "Taun We",
    "image": "https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-bounty-lost-story-gallery-03_1878426f.jpeg?region=440%2C24%2C838%2C471",
    "description": "A beautiful sylph-like Kaminoan, Taun We is the administrative aide to the Prime Minister of Kamino, Lama Su. When Obi-Wan Kenobi arrived at the rain-swept platforms of Tipoca City, he was greeted by the gentle Taun We. Taun We explained that the Kaminoans had long been expecting the arrival of a Jedi envoy, since a Jedi representative, Master Sifo-Dyas, commissioned a clone army a decade earlier. Kenobi bluffed his way into the heart of the cloning operation, and had the naive Taun We introduce him to the original source of the clones, Jango Fett.",
    "height": "213",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "grey",
    "eye_color": "black",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "10",
    "films": ["5"]
  },
  {
    "_id": "74",
    "name": "Jocasta Nu",
    "image": "https://lumiere-a.akamaihd.net/v1/images/jocasta-nu_a3b32f08.jpeg?region=18%2C0%2C2208%2C1242",
    "description": "The Jedi Archives are the galaxy's greatest repository of knowledge, and Madame Jocasta Nu is their Chief Librarian. She helps other Jedi find information in the Archive using its data terminals, and she controls access to the restricted contents of its Holocron Vault. Jocasta Nu can sometimes be too confident in thinking that the Archives contain the correct answers to all questions.",
    "height": "167",
    "mass": "unknown",
    "hair_color": "white",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "9",
    "films": ["5"]
  },
  {
    "_id": "75",
    "name": "R4-P17",
    "image": "https://lumiere-a.akamaihd.net/v1/images/r4-p17_19602f62.jpeg?region=314%2C0%2C1181%2C665",
    "description": "R4-P17 was an astromech droid assigned to Obi-Wan Kenobi, and assisted the Jedi Master on many missions, from Kamino and Geonosis to Teth and Tatooine. She was destroyed during the Battle of Coruscant when buzz droids swarmed Obi-Wan’s fighter, ripping the faithful droid’s dome from her metal body.",
    "height": "96",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "silver, red",
    "eye_color": "red, blue",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "28",
    "films": ["5", "6"]
  },
  {
    "_id": "76",
    "name": "Wat Tambor",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_emirwattambor_01_169_9528ba0f.jpeg?region=53%2C0%2C1454%2C818",
    "description": "The foreman of the Techno Union, Wat Tambor was one of the original and most fervent Separatist leaders, pledging his loyalty and his battle droid armies to Count Dooku at a pivotal meeting on Geonosis. Later in the war, Tambor was appointed emir of Ryloth. His occupation was a cruel one, in which Tambor stripped the Twi'leks of whatever valuables he could find, then bombed their villages.",
    "height": "193",
    "mass": "48",
    "hair_color": "none",
    "skin_color": "green, grey",
    "eye_color": "unknown",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "56",
    "films": ["5"]
  },
  {
    "_id": "77",
    "name": "San Hill",
    "image": "https://lumiere-a.akamaihd.net/v1/images/san-hill_852a226d.jpeg?region=298%2C0%2C1175%2C661",
    "description": "San Hill was a male Muun who was the chairman of the InterGalactic Banking Clan at the onset of the Clone Wars and signed Count Dooku’s treaty. He served as the IG representative on the Separatist Council until he was murdered unceremoniously by the Sith Lord Darth Vader shortly after the end of the war.",
    "height": "191",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "grey",
    "eye_color": "gold",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "57",
    "films": ["5"]
  },
  {
    "_id": "78",
    "name": "Shaak Ti",
    "image": "https://lumiere-a.akamaihd.net/v1/images/shaak_ti_9523e7c7.jpeg?region=241%2C0%2C1438%2C809",
    "description": "A wise and patient Jedi Master, the Togruta Shaak Ti fought at the Battle of Geonosis, and supervised the training of clone cadets on Kamino. There, she struggled to balance the necessity of producing capable troopers with compassion for the clones as living beings. Ti helped defend Kamino against Separatist attack, balancing assignments in the field with her duties on the Jedi Council.",
    "height": "178",
    "mass": "57",
    "hair_color": "none",
    "skin_color": "red, blue, white",
    "eye_color": "black",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "58",
    "films": ["5", "6"]
  },
  {
    "_id": "79",
    "name": "Grievous",
    "image": "https://lumiere-a.akamaihd.net/v1/images/General-Grievous_c9df9cb5.jpeg?region=0%2C0%2C1200%2C675",
    "description": "General Grievous was a brilliant Separatist military strategist and a feared Jedi hunter, known for his ruthlessness and hacking cough. His body itself was a weapon, allowing him lightning quick strikes and devastating blows. But he was also quick to run from a fight, a tactic that worked until one final meeting with Obi-Wan Kenobi.",
    "height": "216",
    "mass": "159",
    "hair_color": "none",
    "skin_color": "brown, white",
    "eye_color": "green, yellow",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "59",
    "films": ["6"]
  },
  {
    "_id": "80",
    "name": "Tarfful",
    "image": "https://lumiere-a.akamaihd.net/v1/images/tarrful_f20d3412.jpeg?region=359%2C0%2C1136%2C639",
    "description": "A massive Wookiee general, Tarfful helped defend his native Kashyyyk during the Clone Wars. A distress signal brought Tarfful and his most trusted warriors rushing to Chewbacca's help against the hated Trandoshans on the hunting grounds of Wasskah. Later, Tarfful and Chewbacca fought side by side with General Yoda on the battlegrounds of Kashyyyk.",
    "height": "234",
    "mass": "136",
    "hair_color": "brown",
    "skin_color": "brown",
    "eye_color": "blue",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "14",
    "films": ["6"]
  },
  {
    "_id": "81",
    "name": "Raymus Antilles",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_captainantilles_01_169_75e05265.jpeg?region=0%2C0%2C1560%2C878",
    "description": "A level-headed ship officer schooled in diplomacy, and a capable pilot entrusted to ferry about the royal family of Alderaan, Captain Antilles served in Bail Organa's command staff. He was part of the bridge crew of Organa's diplomatic cruiser, a role he would continue during the time Princess Leia served as Senator of Alderaan.",
    "height": "188",
    "mass": "79",
    "hair_color": "brown",
    "skin_color": "light",
    "eye_color": "brown",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "2",
    "films": ["1", "6"]
  },
  {
    "_id": "82",
    "name": "Sly Moore",
    "image": "https://lumiere-a.akamaihd.net/v1/images/sly-moore_6af90e66.jpeg?region=95%2C133%2C1116%2C628",
    "description": "A pale Umbaran, Sly Moore served as Palpatine’s senior administrative aide during his chancellorship, attending to countless affairs of state. Moore’s enigmatic silence made her the object of considerable curiosity on Coruscant, with rumors abounding about her past and mysterious abilities she supposedly possessed.",
    "height": "178",
    "mass": "48",
    "hair_color": "none",
    "skin_color": "pale",
    "eye_color": "white",
    "birth_year": "unknown",
    "gender": "female",
    "homeworld": "60",
    "films": ["5", "6"]
  },
  {
    "_id": "83",
    "name": "Tion Medon",
    "image": "https://lumiere-a.akamaihd.net/v1/images/databank_tionmedon_01_169_bf78864d.jpeg?region=0%2C0%2C1560%2C878",
    "description": "Greeting Obi-Wan Kenobi during his search for General Grievous on windswept Utapau was Port Administrator Tion Medon. The tall, gaunt Utapaun initially feigned ignorance about Grievous' whereabouts, but then whispered a warning to Kenobi. Grievous was indeed on the planet, hiding on the tenth level of the sinkhole city with an army of thousands of battle droids.",
    "height": "206",
    "mass": "80",
    "hair_color": "none",
    "skin_color": "grey",
    "eye_color": "black",
    "birth_year": "unknown",
    "gender": "male",
    "homeworld": "12",
    "films": ["6"]
  }
]
